Revit 2015 API
GeometryObjectArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public virtual GeometryObjectArrayIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As GeometryObjectArrayIterator
Visual C++
public:
virtual GeometryObjectArrayIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the array.
See Also
GeometryObjectArray Class
Autodesk.Revit.DB Namespace